In [1]:
%load_ext sql

In [2]:
%sql postgresql://student:student@127.0.0.1/sparkifydb

'Connected: student@sparkifydb'

In [3]:
%sql SELECT * FROM songplays LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[(1, datetime.datetime(2018, 11, 10, 0, 15, 27, 796000), 96, 'free', None, None, 132, 'Richmond, VA', '"Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4) AppleWebKit/537.77.4 (KHTML, like Gecko) Version/7.0.5 Safari/537.77.4"'),
 (2, datetime.datetime(2018, 11, 10, 0, 19, 28, 796000), 96, 'free', None, None, 132, 'Richmond, VA', '"Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4) AppleWebKit/537.77.4 (KHTML, like Gecko) Version/7.0.5 Safari/537.77.4"'),
 (3, datetime.datetime(2018, 11, 10, 0, 23, 37, 796000), 96, 'free', None, None, 132, 'Richmond, VA', '"Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4) AppleWebKit/537.77.4 (KHTML, like Gecko) Version/7.0.5 Safari/537.77.4"'),
 (4, datetime.datetime(2018, 11, 10, 0, 29, 18, 796000), 96, 'free', None, None, 132, 'Richmond, VA', '"Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4) AppleWebKit/537.77.4 (KHTML, like Gecko) Version/7.0.5 Safari/537.77.4"'),
 (5, datetime.datetime(2018, 11, 10, 4, 1, 42, 796000), 26, 'free', None, None, 433, 'San Jose-Sunnyvale-Santa Clara, CA', '"Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/537.36 (KHTML, like Gecko) Ubuntu Chromium/36.0.1985.125 Chrome/36.0.1985.125 Safari/537.36"')]

In [4]:
%sql SELECT * FROM users LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[(96, 'Cierra', 'Finley', 'F', 'free'),
 (26, 'Ryan', 'Smith', 'M', 'free'),
 (16, 'Rylan', 'George', 'M', 'free'),
 (44, 'Aleena', 'Kirby', 'F', 'paid'),
 (37, 'Jordan', 'Hicks', 'F', 'free')]

In [5]:
%sql SELECT * FROM songs LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[('SORRZGD12A6310DBC3', 'Harajuku Girls', 'ARVBRGZ1187FB4675A', 2004, Decimal('290.55955')),
 ('SODAUVL12A8C13D184', 'Prognosis', 'ARWB3G61187FB49404', 2000, Decimal('363.85914')),
 ('SOUPIRU12A6D4FA1E1', 'Der Kleine Dompfaff', 'ARJIE2Y1187B994AB7', 0, Decimal('152.92036')),
 ('SONWXQJ12A8C134D94', 'The Ballad Of Sleeping Beauty', 'ARNF6401187FB57032', 1994, Decimal('305.162')),
 ('SODREIN12A58A7F2E5', 'A Whiter Shade Of Pale (Live @ Fillmore West)', 'ARLTWXK1187FB5A3F8', 0, Decimal('326.00771'))]

In [6]:
%sql SELECT * FROM artists LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[('ARVBRGZ1187FB4675A', 'Gwen Stefani', '', Decimal('NaN'), Decimal('NaN')),
 ('ARWB3G61187FB49404', 'Steve Morse', 'Hamilton, Ohio', Decimal('NaN'), Decimal('NaN')),
 ('ARJIE2Y1187B994AB7', 'Line Renaud', '', Decimal('NaN'), Decimal('NaN')),
 ('ARNF6401187FB57032', 'Sophie B. Hawkins', 'New York, NY [Manhattan]', Decimal('40.79086'), Decimal('-73.96644')),
 ('ARLTWXK1187FB5A3F8', 'King Curtis', 'Fort Worth, TX', Decimal('32.74863'), Decimal('-97.32925'))]

In [7]:
%sql SELECT * FROM time LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[(datetime.datetime(2018, 11, 10, 0, 15, 27, 796000), 0, 10, 45, 11, 2018, 5),
 (datetime.datetime(2018, 11, 10, 0, 19, 28, 796000), 0, 10, 45, 11, 2018, 5),
 (datetime.datetime(2018, 11, 10, 0, 23, 37, 796000), 0, 10, 45, 11, 2018, 5),
 (datetime.datetime(2018, 11, 10, 0, 29, 18, 796000), 0, 10, 45, 11, 2018, 5),
 (datetime.datetime(2018, 11, 10, 4, 1, 42, 796000), 4, 10, 45, 11, 2018, 5)]

## REMEMBER: Restart this notebook to close connection to `sparkifydb`
Each time you run the cells above, remember to restart this notebook to close the connection to your database. Otherwise, you won't be able to run your code in `create_tables.py`, `etl.py`, or `etl.ipynb` files since you can't make multiple connections to the same database (in this case, sparkifydb).

 * postgresql://student:***@127.0.0.1/sparkifydb
1 rows affected.

[(6787, datetime.datetime(2018, 11, 21, 21, 56, 47, 796000), 15, 'paid', 'SOZCTXZ12AB0182364', 'AR5KOSW1187FB35FF4', 818, 'Chicago-Naperville-Elgin, IL-IN-WI', '"Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/537.36 (KHTML, like Gecko) Ubuntu Chromium/36.0.1985.125 Chrome/36.0.1985.125 Safari/537.36"')]